{
  "ruleset": {
    "dataset_name": "fed_hawk_dove",
    "task_description": "Label statements from Federal Reserve officials according to their monetary policy stance, ranging from very dovish (-2) to very hawkish (2).",
    "label_categories": [
      "-2 (very dovish)",
      "-1 (dovish)",
      "0 (neutral)",
      "1 (hawkish)",
      "2 (very hawkish)"
    ],
    "rules": [
      {
        "rule_id": "rule_1",
        "label": "-2 (very dovish)",
        "pattern_description": "Statements strongly advocating monetary easing, large or emergency rate cuts, quantitative easing expansions, or expressing significant concern about unemployment with no inflation worries.",
        "conditions": [
          "Explicit call or support for rate cuts or easing policies",
          "Mention of expansion or continuation of quantitative easing or asset purchases",
          "Expressing significant concern about unemployment without inflation concern",
          "Statements indicating readiness or calls for insurance cuts or aggressive easing due to risks"
        ],
        "indicators": [
          "rate cut",
          "quantitative easing",
          "QE",
          "emergency easing",
          "insurance cut",
          "more accommodation",
          "significant unemployment concern",
          "support easing",
          "lower rates",
          "overshoot inflation target",
          "patient policy but leaning dovish",
          "low inflation concern"
        ],
        "examples": [
          "*BULLARD: FED MUST CONSIDER ADDITIONAL RATE-CUT INSURANCE",
          "*BARKIN: FED'S RATE CUTS REFLECT UNCERTAINTY OVER OUTLOOK",
          "*BULLARD: FED'S THREE RATE CUTS PROVIDE INSURANCE FOR ECONOMY",
          "*BULLARD: JULY CUT WOULD BE INSURANCE AGAINST LOW INFL.",
          "*KASHKARI: I'M FIRMLY IN THE CAMP OF PROVIDING A LOT OF SUPPORT",
          "*BULLARD SAYS MARKET PUT HIGH PROBABILITY ON MORE QE BY FED",
          "*WILLIAMS: FED DOING EVERYTHING IN ITS POWER TO SUPPORT ECONOMY",
          "*BERNANKE SAYS THE WORLD `IS IN AN EASING CYCLE'",
          "*POWELL: WE WILL DO OUR PART TO KEEP ECONOMY STRONG",
          "*EVANS SAYS NEGATIVE U.S. GROWTH RATE IN 1Q, 2ND QTR TO BE TOUGH",
          "*KAPLAN SAYS HE BACKED THE FED'D JULY RATE CUT",
          "*BULLARD SAYS HE EXPECTS UNEMPLOYMENT WILL FALL BELOW 5% IN 2015",
          "*BULLARD SAYS HE DOESN'T KNOW IF THERE'S A BUBBLE IN STOCK MKT"
        ],
        "counter_examples": [
          "*POWELL: NEED TO PUSH AHEAD WITH RATE INCREASES",
          "*HARKER: FED SHOULD KEEP RESTRICTIVE STANCE FOR A WHILE"
        ],
        "confidence": 0.95,
        "frequency": 20,
        "edge_cases": [
          "Statements expressing concern about unemployment but also moderate inflation concerns may be labeled -1 instead."
        ],
        "creation_timestamp": "2023-11-23T12:00:00Z",
        "last_updated": "2024-06-01T12:00:00Z",
        "source_data_hash": null
      },
      {
        "rule_id": "rule_2",
        "label": "-1 (dovish)",
        "pattern_description": "Statements signaling mild dovish stance or caution; concerns about inflation risks but advocating patience; moderate support for easing or caution on tightening; warnings of economic risks or slow growth without explicit calls for strong easing.",
        "conditions": [
          "Expressions of mild concern about inflation or economic risks",
          "Advocacy for patience or caution in policy moves",
          "Moderate support for easing or delayed tightening",
          "Warnings of economic slowdown or downside risks",
          "Statements highlighting uncertainties or mixed signals"
        ],
        "indicators": [
          "worry about inflation",
          "caution",
          "patience",
          "slow growth",
          "economic risks",
          "not ready to raise rates",
          "uncertainty",
          "support for gradual approach",
          "risk of recession",
          "moderate easing",
          "low inflation concern but watchful",
          "concern about labor market or credit conditions"
        ],
        "examples": [
          "*EVANS: MORE WORRIED ABOUT TOO LOW INFLATION THAN TOO HIGH",
          "*POWELL NOTED RISKS OF GOVT SHUTDOWN, STUDENT-LOAN PAYMENTS",
          "*KOHN SAYS CREDIT AVAILABILITY `RELATIVELY LIMITED'",
          "*BOSTIC: U.S. TARIFFS ON CHINA HAVE AFFECTED REGION'S BUSINESS",
          "*CLARIDA: WHEN GLOBAL ECONOMY SLOWS, IT DOES IMPACT U.S.",
          "*GOOLSBEE: AS INFLATION COMES DOWN, OPENS DOOR FOR RATE CUTS",
          "*CHICAGO FED'S EVANS SEES WEAK CONSTRUCTION GROWTH",
          "*KASHKARI: OUGHT GIVE MORE SUPPORT IF DOWNSIDE RISKS INCREASED",
          "*BULLARD: MUST BE CAREFUL WITH VIRUS, THERE IS TAIL RISK THERE",
          "*EVANS SAYS INFLATION IS `RELATIVELY SLOW MOVING'",
          "*BULLARD SAYS RISING RATES POSE A HEADWIND TO ECONOMIC GROWTH",
          "*LOCKHART SAYS ECONOMIC RECOVERY IN U.S. REMAINS `FRAGILE'",
          "*MESTER: LOTS OF HOUSEHOLDS, SMALL BUSINESSES STILL NEED HELP",
          "*BOSTIC: LACK OF CHEAPER HOMES IMPOSES BURDENS LIKE CONGESTION",
          "*POWELL: JOBLESS RATE REMAINS ELEVATED",
          "*BULLARD: FED'S WILLIAMS WAS CONSISTENT W/ WHAT HE'S SAID BEFORE",
          "*POWELL: VERY LIKELY TO BE SOME SOFTENING IN LABOR-MKT CONDITION",
          "*BULLARD: FED ACTIONS ALREADY PREEMPTIVE TOWARD NEGATIVE SHOCKS",
          "*KASHKARI: THERE IS STILL SLACK SOME IN THE LABOR MARKET",
          "*MESTER: DOWNSIDE RISKS DOMINATE OVER THE UPSIDE RISKS",
          "*CLARIDA: LONG-TERM INFLATION EXPECTATIONS AT RISK OF FALLING",
          "*DALY: NEED TO BRING AGILITY TO BANK SUPERVISORY WORK",
          "*HARKER: FED DOING EVERYTHING IN ITS POWER TO SUPPORT ECONOMY",
          "*BARKIN: MAY SEE INFLATION `GO BACKWARD' AS PRICES NORMALIZE",
          "*BULLARD: NOT CONCERNED BY STRESS LEVELS FOLLOWING MKT SELLOFF",
          "*WILLIAMS: SEE A LOT OF DOWNWARD PRESSURE ON INFLATION",
          "*BULLARD: FED NOT AS FAR BEHIND CURVE JUDGED ON 2-YEAR YIELDS",
          "*BULLARD: FED SAYS MARKET PUT HIGH PROBABILITY ON MORE QE",
          "*POWELL: CONTINUED BELOW-TARGET INFLATION COULD HIT EXPECTATIONS"
        ],
        "counter_examples": [
          "*POWELL: WE WILL MOVE STEADILY AWAY FROM ACCOMMODATION THIS YEAR",
          "*HARKER: FED SHOULD KEEP RESTRICTIVE STANCE FOR A WHILE"
        ],
        "confidence": 0.9,
        "frequency": 50,
        "edge_cases": [
          "Statements that mention risks but have no clear policy stance may be labeled 0 (neutral)."
        ],
        "creation_timestamp": "2023-11-23T12:00:00Z",
        "last_updated": "2024-06-01T12:00:00Z",
        "source_data_hash": null
      },
      {
        "rule_id": "rule_3",
        "label": "0 (neutral)",
        "pattern_description": "Statements that are informational, balanced, or neutral in tone without clear hawkish or dovish bias; often describing current conditions, outlook, procedural or organizational information, or balanced concerns.",
        "conditions": [
          "Descriptive or factual statements about economic data or conditions",
          "Statements expressing balanced views without clear policy bias",
          "References to procedures, meetings, or organizational details",
          "Expressions of uncertainty or mixed signals without directional bias",
          "Statements about inflation, employment, or growth without clear stance"
        ],
        "indicators": [
          "neutral tone",
          "balanced view",
          "informational",
          "procedural",
          "economic data",
          "uncertainty",
          "no clear policy direction",
          "mixed signals"
        ],
        "examples": [
          "*POWELL: MAIN STREET WILL BE OPEN TO RECEIVE LOANS WITHIN A WEEK",
          "*WILLIAMS: HARD TO PREDICT WHERE AMPLE RESERVES ARE",
          "*FISHER SAYS HE'S WORRIED FED POLICY HAS `TWISTED' YIELD CURVE",
          "*MESTER: FED'S GRADUAL PACE INCORPORATES BELOW-TARGET INFLATION",
          "*MESTER: WILLING TO BE PATIENT WITH INFLATION ON DOWNSIDE",
          "*KAPLAN: GDP GROWTH TO RETURN TO POTENTIAL RATE IN 2020-21",
          "*BOSTIC: FED'S MANDATE TO SERVE ECONOMY, NOT FINANCIAL MARKETS",
          "*BULLARD: FED MAY BE ABLE TO REVIEW INFLATION TARGET IN FUTURE",
          "*EVANS SAYS INFLATION HAS REMAINED `RELATIVELY TAME'",
          "*CLARIDA REITERATES NO LIFTOFF UNTIL INFLATION SUSTAINED AT 2%",
          "*POWELL: GDP IS BEING DRIVEN BY STRONG CONSUMER SPENDING",
          "*BULLARD URGES LABOR MARKET POLICIES, NOT QE, TO CUT JOBLESSNESS",
          "*BOSTIC: UNLIKELY TO GET CLEAR UNDERLYING INFLATION READING YET",
          "*YELLEN: MONETARY POLICY NOT ON PRESET COURSE",
          "*FED'S MESTER: DON'T SEE FED CUTTING RATES NEXT YEAR",
          "*BULLARD: NOT WORRIED BY DOLLAR IMPACT ON GROWTH AT CURRENT VALUE",
          "*FED SAYS BANKS ALLOWED TO ANNOUNCE PAYOUTS STARTING FRIDAY",
          "*FED SAYS NEED FOR `BROAD-BASED' CRISIS SUPPORT `HAS DISSIPATED'",
          "*POWELL: VERY CHALLENGING TO FIGURE OUT CREDIT NEEDS AMONG FIRMS",
          "*FED'S MESTER: US ECONOMY DOING OK, JOB MARKET STRONG",
          "*POWELL: DECLINES TO ANSWER QUESTION ON SIZE OF STIMULUS AID",
          "*YELLEN: FED NOT KEEPING RATES LOW TO HELP FINANCE U.S. DEFICIT",
          "*FED'S HARKER: WE'RE LOOKING AT A LONG PERIOD OF NEAR-ZERO RATES",
          "*BULLARD: FED'S WILLIAMS WAS CONSISTENT W/ WHAT HE'S SAID BEFORE",
          "*POWELL: NEVER WANT TO OVER-REACT TO ANY ONE DATA POINT",
          "*KAPLAN: BIG PART OF GROWTH DECELERATION IS TRADE UNCERTAINTY",
          "*FED'S BULLARD: WE SHOULD JUST WRITE OFF THE SECOND QUARTER",
          "*FED'S BULLARD: U.S. IS 'IN GOOD SHAPE' WITH SOME DOWNSIDE RISKS",
          "*POWELL: WILL TALK ABOUT ACCELERATING TAPER AT NEXT MEETING",
          "*FED'S MESTER: WE'RE GETTING CLOSE TO PEAK, NEED TO BE DILIGENT",
          "*FED'S MESTER: POLICY NEEDS TO BE UBER-DATA DEPENDENT",
          "*BOSTIC: CURRENT FED RATE STANCE IS `APPROPRIATELY RESTRICTIVE'",
          "*POWELL: FOMC DETERMINED TO RESTORE PRICE STABILITY",
          "*FED'S GOOLSBEE SAYS THERE'S GOOD AND BAD NEWS ON INFLATION",
          "*FED SAYS SEVERAL DISTRICTS REPORTED INCREASED HOME REFINANCING",
          "*FED'S HARKER: NOT SEEING ANY PRESSURE ON INFLATION",
          "*FED SAYS ECONOMIC ACTIVITY EXPANDED AT 'STRONG PACE' IN Q3",
          "*FED SAYS TO CONTINUE TREASURY, MBS BUYING IN AMOUNTS NEEDED"
        ],
        "counter_examples": [
          "*POWELL: WE WILL MOVE STEADILY AWAY FROM ACCOMMODATION THIS YEAR",
          "*BULLARD: MUST CONSIDER ADDITIONAL RATE-CUT INSURANCE"
        ],
        "confidence": 0.9,
        "frequency": 100,
        "edge_cases": [
          "Statements reporting mixed or uncertain economic outlooks without clear policy stance.",
          "Statements mentioning risks but no direct policy recommendation."
        ],
        "creation_timestamp": "2023-11-23T12:00:00Z",
        "last_updated": "2024-06-01T12:00:00Z",
        "source_data_hash": null
      },
      {
        "rule_id": "rule_4",
        "label": "1 (hawkish)",
        "pattern_description": "Statements signaling moderate tightening stance, readiness to raise rates, concern over inflation, or signaling policy moves to reduce inflation risks; includes cautious or conditional hawkish tones.",
        "conditions": [
          "Expressions of concern about inflation risks and readiness to tighten",
          "Statements indicating gradual or moderate rate hikes or tapering",
          "Emphasis on data-dependency with inclination towards tightening",
          "Warnings about inflation or risks to price stability",
          "Statements indicating measures to avoid overheating or excessive growth"
        ],
        "indicators": [
          "rate hike",
          "gradual tightening",
          "inflation concern",
          "reduce inflation risks",
          "moderate hawkishness",
          "data dependent tightening",
          "caution with inflation",
          "gradual policy normalization",
          "tapering",
          "raising rates",
          "restrictive stance",
          "price stability focus"
        ],
        "examples": [
          "*FED'S MESTER NOTES FIVE-YEAR INFLATION AVERAGE WELL ABOVE 2%",
          "*KASHKARI: `I'M NOT READY TO SAY THAT WE'RE DONE' RAISING RATES",
          "*POWELL: WE DON'T DISMISS CHANCE HIGHER PRICES GO ON FOR LONGER",
          "*BARKIN WARNS HIGH INFLATION COULD RETURN IF FED 'UNDERCORRECTS'",
          "*BULLARD REPEATS HE FAVORS FED SPEEDING UP THE PACE OF TAPER",
          "*BULLARD: MAKES SENSE TO MOVE MORE HAWKISHLY, MANAGE PRICE RISK",
          "*BULLARD: FED'S WILLIAMS WAS CONSISTENT W/ WHAT HE'S SAID BEFORE",
          "*KAPLAN: 3 RATE HIKES `APPROPRIATE' FOR 2018",
          "*POWELL: FOMC DETERMINED TO RESTORE PRICE STABILITY",
          "*BULLARD: HAS RATES RISING TO WHERE THEY WERE PRE-PANDEMIC",
          "*FED'S DALY: ECONOMY IS SELF-BRIDLING ITSELF TO SUSTAINABLE PACE",
          "*FED'S MESTER: VERY IMPORTANT FOR FED TO CONFRONT INFLATION",
          "*DALY: FED MUST REMOVE ACCOMMODATION BUT ALSO OPEN TO DATA",
          "*HOENIG SAYS RATES SHOULD BE RAISED `SOONER RATHER THAN LATER'",
          "*LOGAN: CONTINUED RESTRICTIVE FIN COND NEEDED FOR PRICE STABILITY",
          "*FED'S BULLARD SAYS WILL REMOVE QE IN `REASONABLE TIME FRAME'",
          "*MINERD: EXPECT YELLEN TO ANNOUNCE FED DRAWDOWN PLAN IN SEPT.",
          "*FED'S HARKER: 25 BPS HIKES `WILL BE APPROPRIATE GOING FORWARD’",
          "*BOSTIC: BEST CASE IS FED WON'T MULL RATE CUT TILL WELL INTO '24",
          "*POWELL: NEED TO PUSH AHEAD WITH RATE INCREASES",
          "*FED'S BULLARD SAYS RATES WILL PROBABLY HAVE TO GRIND HIGHER",
          "*BOWMAN: MAY SEE INFLATION LASTING LONGER THAN WE EXPECTED",
          "*BULLARD: ABOVE-TREND 4Q, 1H 2021 GDP GROWTH IS BASE CASE",
          "*BULLARD: FED'S WILLIAMS WAS CONSISTENT W/ WHAT HE'S SAID BEFORE",
          "*BULLARD: FED'S WILLIAMS WAS CONSISTENT W/ WHAT HE'S SAID BEFORE"
        ],
        "counter_examples": [
          "*BULLARD: MUST BE CAREFUL WITH VIRUS, THERE IS TAIL RISK THERE",
          "*POWELL: WE WILL DO OUR PART TO KEEP ECONOMY STRONG"
        ],
        "confidence": 0.93,
        "frequency": 40,
        "edge_cases": [
          "Statements that express caution but lean hawkish should be labeled 1 rather than 2."
        ],
        "creation_timestamp": "2023-11-23T12:00:00Z",
        "last_updated": "2024-06-01T12:00:00Z",
        "source_data_hash": null
      },
      {
        "rule_id": "rule_5",
        "label": "2 (very hawkish)",
        "pattern_description": "Statements indicating strong commitment to aggressive tightening, large or multiple rate hikes, rapid balance sheet reduction, or urgent concern about inflation requiring decisive action; includes policy signals for fast or significant hikes.",
        "conditions": [
          "Explicit calls or implementation of rapid or large rate hikes",
          "Strong emphasis on inflation risks requiring urgent action",
          "Statements indicating aggressive balance sheet reduction or rapid tapering",
          "Signals of policy moves to decisively curb inflation",
          "Statements indicating restrictive stance well above neutral"
        ],
        "indicators": [
          "large rate hike",
          "rapid tightening",
          "aggressive policy",
          "balance sheet reduction",
          "multiple rate hikes",
          "peak rates above neutral",
          "urgent inflation concern",
          "fast pace hikes",
          "restrictive policy",
          "decisive action"
        ],
        "examples": [
          "*HARKER: FED SHOULD KEEP RESTRICTIVE STANCE FOR A WHILE",
          "*POWELL: WE WILL MOVE STEADILY AWAY FROM ACCOMMODATION THIS YEAR",
          "*BOSTIC: `EVERY OPTION IS ON THE TABLE' FOR RATE MOVEMENTS",
          "*PLOSSER SAYS FED TO TAPER MONTHLY PURCHASES BEFORE HALTING QE",
          "*DALY: FED RATE INCREASES COULD COME AS EARLY AS MARCH",
          "*KAPLAN: 3 RATE HIKES `APPROPRIATE' FOR 2018",
          "*BULLARD FAVORS FIRST HALF-POINT U.S. RATE INCREASE SINCE 2000",
          "*FED'S MESTER: NO ‘COMPELLING’ REASON TO WAIT FOR RATE RISE",
          "*LOGAN: CONTINUED RESTRICTIVE FIN COND NEEDED FOR PRICE STABILITY",
          "*FED'S BULLARD SAYS RATES WILL PROBABLY HAVE TO GRIND HIGHER",
          "*BOWMAN: NEED TO KEEP RATES AT RESTRICTIVE LEVEL FOR SOME TIME",
          "*POWELL: WE'LL RAISE RATES AND SHRINK BALANCE SHEET OVER 2022",
          "*HARKER: 75 BP INCREASE HELPS GET US TO NEUTRAL STANCE",
          "*BULLARD: HAS RATES RISING TO WHERE THEY WERE PRE-PANDEMIC",
          "*FED'S BULLARD SAYS RATES WILL PROBABLY HAVE TO GRIND HIGHER",
          "*POWELL: NEED TO PUSH AHEAD WITH RATE INCREASES"
        ],
        "counter_examples": [
          "*BULLARD: MUST BE CAREFUL WITH VIRUS, THERE IS TAIL RISK THERE",
          "*EVANS SAYS INFLATION IS `RELATIVELY SLOW MOVING'"
        ],
        "confidence": 0.95,
        "frequency": 30,
        "edge_cases": [
          "Statements expressing hawkish views but with caution should be labeled 1 (hawkish) instead of 2.",
          "Statements about gradual tightening but without urgency should not be labeled 2."
        ],
        "creation_timestamp": "2023-11-23T12:00:00Z",
        "last_updated": "2024-06-01T12:00:00Z",
        "source_data_hash": null
      }
    ],
    "general_guidelines": [
      "Label statements based on the overall monetary policy stance expressed or implied by the speaker.",
      "Consider both explicit policy actions and the tone or urgency regarding inflation and employment.",
      "When statements are ambiguous or mixed, lean towards the label that reflects the dominant tone.",
      "Avoid labeling statements with no clear policy content as hawkish or dovish; use neutral (0) instead.",
      "Annotations should focus on the policy stance, not unrelated factual or procedural information.",
      "In cases where statements refer to risks or uncertainties without clear stance, label as neutral (0).",
      "Statements expressing policy outlook or future intentions should be labeled according to the expected stance communicated."
    ],
    "disambiguation_rules": [
      "If a statement expresses concern about inflation but also calls for patience, label as -1 (dovish) rather than 1 (hawkish).",
      "Statements expressing caution with leaning hawkish tone should be labeled 1 (hawkish), not 2 (very hawkish).",
      "Statements with mixed signals but no clear direction should be labeled 0 (neutral).",
      "Statements about economic data or conditions without policy implications should be labeled 0 (neutral)."
    ],
    "quality_checks": [
      "Annotators should verify the presence of clear policy stance or tone before assigning labels.",
      "Cross-check similar statements to ensure consistent labeling between dovish and neutral or hawkish and neutral.",
      "Verify that statements about procedural or organizational matters are labeled neutral.",
      "Ensure that strong policy signals are not mislabeled as moderate or neutral."
    ],
    "version": "1.0.17",
    "creation_timestamp": "2025-06-10T14:15:18.819602",
    "last_updated": "2025-06-10T14:55:00.157940",
    "statistics": null
  },
  "batch_num": 18,
  "last_updated": "2025-06-10T14:55:00.158160"
}