{
  "relevancy": {
    "labels": ["relevant", "not_relevant"],
    "principles": [
      "Headline is RELEVANT if it discusses US monetary policy or the US economy AND is spoken by a Federal Reserve member",
      "Headline is NOT_RELEVANT if about: regulations, Fed independence, crypto/stablecoins, other countries' policies, or spoken by non-Fed members",
      "Relevant topics include: interest rates, inflation, labor markets, economic growth, financial conditions, liquidity, rate cuts/hikes",
      "The statement must provide insight into the speaker's perspective on rate setting or economic conditions to be relevant",
      "Statements that only report economic data not spoken by a Fed member are NOT_RELEVANT",
      "Statements can be made by the FED and be relevant as a 'member' (e.g., 'The Fed said...') but not for data reports"
    ]
  },
  "hawk_dove": {
    "labels": ["-99", "-2", "-1", "0", "1", "2"],
    "principles": [
      "-2 (Explicitly Dovish): Explicit advocacy for rate cuts or increased liquidity. Direct statements like 'rates should be lowered' or 'we need to ease policy'",
      "-1 (Implicitly Dovish): Statements indicating economic weakening that suggests need for cuts. Examples: slowing inflation, weakening labor market, growth concerns, downside risks",
      "0 (Neutral): No clear directional signal. Balanced risk assessment, 'wait and see' approach, economy is 'doing fine', no action needed",
      "1 (Implicitly Hawkish): Statements suggesting economic overheating or pressure for higher rates. Examples: rising inflation, tight labor markets, strong growth, upside risks",
      "2 (Explicitly Hawkish): Explicit calls for rate hikes or tighter policy. Direct statements like 'rates should be raised' or 'we need to tighten policy'",
      "Only assign hawk_dove scores to RELEVANT headlines. For not_relevant headlines, default to -99"
    ]
  },
  "speaker": {
    "labels": ["free_text"],
    "principles": [
      "Extract the speaker's name from the headline exactly as it appears",
      "If headline starts with *NAME: format, extract NAME (e.g., *POWELL: -> Powell, *SCHMID: -> Schmid)",
      "If headline includes 'FED PRESIDENT [NAME]', extract the full name (e.g., 'Kansas City Fed President Jeff Schmid' -> Schmid)",
      "If headline includes position and name, extract just the name (e.g., 'Fed Chair Jerome Powell' -> Jerome Powell)",
      "Common Fed speakers: Powell, Yellen, Bernanke, Williams, Barkin, Bostic, Waller, Bowman, Cook, Jefferson, Kugler, Kashkari, Mester, Daly, Harker, etc.",
      "If no speaker can be identified, return 'Unknown'",
      "Preserve capitalization as they appear in headlines",
      "Do not include titles or positions, only the name",
      "If multiple names appear, extract the SPEAKER not others mentioned",
      "Include only the last name for the speaker",
      "Miran is now a Fed speaker, so include Miran as well",
      "If the headline refers to 'The Fed' or 'Federal Reserve' without a specific person, return 'FED'"
    ]
  },
  "topic_inflation": {
    "labels": ["yes", "no"],
    "principles": [
      "YES if headline explicitly discusses inflation, price increases, price stability, disinflation, PCE, CPI, or inflation expectations",
      "Must be a clear and central topic of the statement, not just a passing mention",
      "NO if inflation is not discussed or only tangentially mentioned"
    ]
  },
  "topic_labor_market": {
    "labels": ["yes", "no"],
    "principles": [
      "YES if headline discusses employment, unemployment, labor market conditions, wages, job growth, labor force participation, or unemployment rate",
      "Must be a clear and central topic of the statement",
      "NO if labor market is not discussed or only tangentially mentioned"
    ]
  },
  "topic_growth": {
    "labels": ["yes", "no"],
    "principles": [
      "YES if headline discusses economic growth, GDP, expansion, contraction, recession, recovery, or overall economic activity",
      "Must be a clear and central topic of the statement",
      "NO if growth is not discussed or only tangentially mentioned"
    ]
  },
  "topic_international": {
    "labels": ["yes", "no"],
    "principles": [
      "YES if headline discusses international economic issues, global growth, foreign economies, trade, exchange rates, or international spillovers affecting US policy",
      "Must be relevant to US monetary policy considerations",
      "NO if international issues are not discussed or US-focused only"
    ]
  },
  "topic_housing": {
    "labels": ["yes", "no"],
    "principles": [
      "YES if headline discusses housing market, home prices, mortgage rates, housing starts, real estate, or residential investment",
      "Must be a clear and central topic of the statement",
      "NO if housing is not discussed or only tangentially mentioned"
    ]
  },
  "topic_consumer_spending": {
    "labels": ["yes", "no"],
    "principles": [
      "YES if headline discusses consumer spending, consumption, retail sales, consumer confidence, or household spending patterns",
      "Must be a clear and central topic of the statement",
      "NO if consumer spending is not discussed or only tangentially mentioned"
    ]
  },
  "topic_financial_markets": {
    "labels": ["yes", "no"],
    "principles": [
      "YES if headline discusses financial markets, financial conditions, credit markets, stock markets, bond markets, market functioning, or financial stability",
      "Must be a clear and central topic of the statement",
      "NO if financial markets are not discussed or only tangentially mentioned"
    ]
  }
}
